app/views/noticia/index.html.erb

SELECT "comentarios"."id" FROM "comentarios" WHERE "comentarios"."noticium_id" = $1  [["noticium_id", 1]]
---
        <td><%= noticium.cuerpo %></td>
        <td><%= noticium.comentarios.ids.count %></td>