app/views/noticia/show.html.erb

SELECT "comentarios"."id" FROM "comentarios" WHERE "comentarios"."noticium_id" = $1  [["noticium_id", 1]]
---
  <tbody>
    <% @noticium.comentarios.all.each do |comentario| %>