app/controllers/comentarios_controller.rb

  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save
---
INSERT INTO "comentarios" ("nombre", "contenido", "noticium_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "coment 1"], ["contenido", "bla bla bla"], ["noticium_id", 1], ["created_at", 2017-03-20 02:26:08 UTC], ["updated_at", 2017-03-20 02:26:08 UTC]]

    def set_comentario
      @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]